import numpy as np
import matplotlib.pyplot as plt


x = np.array([143.7,154.32,179.56,181.07,135.44,164.22,168.69,167.54,174.06,201.04,
216.74,235.29,236.43,270.08,263.58,292.05,353.65,379.31,424.58,535,540.81,502.06,536.4,
522.07,518.87,548.81,534.11,600.37,649.81,800.64]) # Nvidia

y = np.array([3411.5,3792.14,4094.99,5270.69, 8554.06,10761.26,10087.3,9600.86,8304.96,9159.48,
7555.92,7165.72,9334.98,8525.07,6424.35,8624.28,9446.57,9136.2,11351.62,11655,10779.63,13804.81,
19713.94,28990.08,33137.74,45231.75,58800,57798.77,37279.31,35060]) # BTC-USD

b2 = np.sum((x - np.mean(x))*(y-np.mean(y)))/np.sum((x - np.mean(x))**2) # b2
print(f"a: {b2}")

b1 = np.mean(y) - b2 * np.mean(x) # b1
print(f"b: {b1}")

plt.scatter(x, y, color = 'red', s = 5) # точки на диаграмме
yPred = b1 + b2 * x # y с крышечкой (^)
print(f"y^: {yPred}")

plt.plot(x, yPred, color = 'black') # чёрный отрезок на диаграмме
plt.text(150, 50000, f"a: {b2}\nb: {b1}")
plt.xlabel('Nvidia') 
plt.ylabel('BTC-USD')
plt.show()